#-------------------------------------------------
# Алгоритм сортировки выбором
#-------------------------------------------------

a = [7, 5, -8, 0, 10, 1]  # Исходный массив
N = len(a)  # Число элементов

for i in range(N-1):  # Проход по всем элементам, кроме последнего
    t = a[i]  # Сохраняем текущий элемент
    min_index = i  # Индекс минимального элемента
    for j in range(i+1, N):  # Проход по неотсортированной части массива
        if a[j] < t:  # Если нашли элемент меньше текущего минимума
            t = a[j]  # Обновляем минимальный элемент
            min_index = j  # Обновляем индекс минимума
    a[i], a[min_index] = t, a[i]  # Меняем местами текущий элемент и минимум

print(a)  # Вывод отсортированного массива
